---
kind: method
id: M:Autodesk.Revit.DB.ExternalFileReference.Dispose
source: html/19e515a4-05d1-d787-695a-890956ccfe22.htm
---
# Autodesk.Revit.DB.ExternalFileReference.Dispose Method

Releases all resources used by the ExternalFileReference

## Syntax (C#)
```csharp
public void Dispose()
```